const herbs = [
  {
    name: '烈焰花',
    color: '黄色',
    effects: ['急迫', '防火', '力量', '缓慢', '药水时间缩短7分'],
  },
  {
    name: '水灵草',
    color: '黄色',
    effects: ['速度', '水下呼吸', '冰缓', '魔导', '药水时间缩短7分'],
  },
  {
    name: '夜光草',
    color: '黄色',
    effects: ['跳跃提升', '夜视', '感性', '诅咒', '药水等级下降1级'],
  },
  {
    name: '寒冰玫瑰',
    color: '蓝色',
    effects: ['生命恢复', '冰缓', '看穿', '伤口', '药水等级提升1级'],
  },
  {
    name: '萤光草',
    color: '黄色',
    effects: ['抗性提升', '急迫', '虚弱', '魔药', '药水时间提升8分'],
  },
  {
    name: '深红香茅',
    color: '红色',
    effects: ['防火', '生命恢复', '伤口', '力量', '药水等级提升1级'],
  },
  {
    name: '龙舌兰草',
    color: '绿色',
    effects: ['水下呼吸', '箭术', '看穿', '诅咒', '药水等级下降1级'],
  },
  {
    name: '火焰荆棘',
    color: '黑色',
    effects: ['夜视', '防火', '魔药', '抗性提升', '药水等级下降1级'],
  },
  {
    name: '死亡花',
    color: '黑色',
    effects: ['贪婪', '生命恢复', '箭术', '凋零', '药水时间提升8分'],
  },
  {
    name: '祝福之心',
    color: '红色',
    effects: ['迅捷', '生命恢复', '铁皮', '抗性提升', '药水时间缩短7分'],
  },
  {
    name: '深红草',
    color: '红色',
    effects: ['精确', '贪婪', '迅捷', '伤口', '药水等级提升1级'],
  },
  {
    name: '圣光花',
    color: '黄色',
    effects: ['箭术', '贪婪', '防火', '迅捷', '药水等级下降1级'],
  },
  {
    name: '影子草',
    color: '黑色',
    effects: ['魔导', '凋零', '幸运', '抗性提升', '药水时间提升8分'],
  },
  {
    name: '冰雪花',
    color: '蓝色',
    effects: ['看穿', '冰缓', '精确', '魔药', '药水时间提升8分'],
  },
  {
    name: '痛苦草',
    color: '红色',
    effects: ['感性', '伤口', '精确', '魔药', '药水等级提升1级'],
  },
  {
    name: '诅咒花',
    color: '红色',
    effects: ['感性', '伤口', '精确', '魔药', '药水等级下降1级'],
  },
  {
    name: '黄金蕨',
    color: '黄色',
    effects: ['铁皮', '贪婪', '幸运', '失手', '药水等级下降1级'],
  },
  {
    name: '蓝晶花',
    color: '蓝色',
    effects: ['幸运', '急迫', '夜视', '失手', '药水时间提升8分'],
  },
  {
    name: '紫玫瑰',
    color: '蓝色',
    effects: ['看穿', '中毒', '力量', '箭术', '药水等级下降1级'],
  },
  {
    name: '火猝花',
    color: '黄色',
    effects: ['速度', '防火', '跳跃提升', '迅捷', '药水时间提升8分'],
  },
  {
    name: '魔凝雏',
    color: '白色',
    effects: ['跳跃提升', '魔导', '伤口', '跳跃提升', '药水时间提升8分'],
  },
  {
    name: '凋零玫瑰',
    color: '黑色',
    effects: ['生命恢复', '凋零', '箭术', '力量', '药水时间提升8分'],
  },
  {
    name: '诡异菌',
    color: '蓝色',
    effects: ['抗性提升', '夜视', '水下呼吸', '跳跃提升', '药水等级下降1级'],
  },
  {
    name: '黄金玫瑰',
    color: '黄色',
    effects: ['铁皮', '贪婪', '防火', '缓慢', '药水时间缩短7分'],
  },
  {
    name: '葡萄藤',
    color: '绿色',
    effects: ['毅力', '饥饿', '急迫', '速度', '药水时间提升8分'],
  },
  {
    name: '水月花',
    color: '蓝色',
    effects: ['水下呼吸', '水下呼吸', '夜视', '冰缓', '药水时间提升8分'],
  },
  {
    name: '紫月蕨',
    color: '蓝色',
    effects: ['贪婪', '中毒', '伤口', '铁皮', '药水等级提升1级'],
  },
  {
    name: '噩梦草',
    color: '黑色',
    effects: ['迅捷', '失手', '魔药', '魔导', '药水等级下降1级'],
  },
  {
    name: '矢车菊',
    color: '蓝色',
    effects: ['精确', '魔导', '急迫', '跳跃提升', '药水时间提升8分'],
  },
  {
    name: '白月花',
    color: '白色',
    effects: ['箭术', '速度', '铁皮', '幸运', '药水等级下降1级'],
  },
  {
    name: '管藤',
    color: '绿色',
    effects: ['魔导', '感性', '失手', '伤口', '药水时间提升8分'],
  },
  {
    name: '咒术疣',
    color: '黑色',
    effects: ['魔药', '毅力', '铁皮', '凋零', '药水等级提升1级'],
  },
  {
    name: '羊肚菌',
    color: '红色',
    effects: ['防火', '魔导', '甜蜜', '脱水', '感性', '药水时间缩短7分'],
  },
  {
    name: '松茸',
    color: '红色',
    effects: ['水下呼吸', '力量', '甜点', '虚弱', '毅力', '药水时间提升8分'],
  },
  {
    name: '松乳菇',
    color: '黄色',
    effects: ['夜视', '箭术', '甜点', '冰缓', '铁皮', '药水时间提升8分'],
  },
  {
    name: '牛肝菌',
    color: '白色',
    effects: ['贪婪', '急迫', '甜蜜', '伤口', '幸运', '药水等级提升1级'],
  },
  {
    name: '毒蝇伞',
    color: '红色',
    effects: ['魔导', '力量', '箭术', '剧毒', '看穿', '药水等级下降1级'],
  },
  {
    name: '墨汁鬼伞',
    color: '蓝色',
    effects: ['速度', '防火', '迅捷', '急迫', '毅力', '药水时间缩短7分'],
  },
  {
    name: '环柄菇',
    color: '白色',
    effects: [
      '力量',
      '甜蜜',
      '抗性提升',
      '跳跃提升',
      '铁皮',
      '药水时间提升8分',
    ],
  },
  {
    name: '蜜环菌',
    color: '黄色',
    effects: [
      '生命恢复',
      '迅捷',
      '跳跃提升',
      '诅咒',
      '幸运',
      '药水时间缩短7分',
    ],
  },
  {
    name: '鸡油菌',
    color: '黄色',
    effects: ['精确', '迅捷', '魔药', '失手', '看穿', '药水等级下降1级'],
  },
  {
    name: '紫丁香蘑',
    color: '蓝色',
    effects: ['急迫', '随机效果', '箭术', '中毒', '看穿', '药水等级提升1级'],
  },
  {
    name: '秀珍菇',
    color: '黑色',
    effects: [
      '生命恢复',
      '随机效果',
      '魔药',
      '凋零',
      '幸运',
      '药水时间缩短7分',
    ],
  },
  {
    name: '绿褶菇',
    color: '黄色',
    effects: ['魔药', '精确', '甜蜜', '速度', '铁皮', '药水等级下降1级'],
  },
  {
    name: '橘黄裸伞',
    color: '黄色',
    effects: ['魔导', '精确', '水下呼吸', '缓慢', '毅力', '药水时间提升8分'],
  },
  {
    name: '花菇',
    color: '红色',
    effects: ['箭术', '生命恢复', '力量', '饥饿', '感性', '药水等级提升1级'],
  },
  {
    name: '粉褶菌',
    color: '蓝色',
    effects: [
      '随机效果',
      '生命恢复',
      '甜蜜',
      '虚弱',
      '毅力',
      '药水等级下降1级',
    ],
  },
  {
    name: '毒鹅膏',
    color: '白色',
    effects: ['抗性提升', '防火', '箭术', '剧毒', '铁皮', '药水时间提升8分'],
  },
];

export interface HerbInfo {
  name: string;
  color: string;
  effects: string[];
}

export default herbs;
